DataProcessors/КалендарьПереговорных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>КалендарьПереговорных</Name>
		</Properties>
		<ChildObjects>
			<Form>
				<Properties>
					<Name>Форма</Name>
				</Properties>
			</Form>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Documents/БронированиеПереговорной.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>БронированиеПереговорной</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комната</Name>
					<Type>
						<v8:Type>d7p1:CatalogRef.ПереговорныеКомнаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Form>
				<Properties>
					<Name>ФормаДокумента</Name>
				</Properties>
			</Form>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/КалендарьПереговорных/Forms/Форма/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Обработка.КалендарьПереговорных - Модуль формы
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ДатаКалендаря = НачалоДня(ТекущаяДата());
	ОбновитьКалендарьНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ИзменениеБронирования" Тогда
		ОбновитьКалендарьНаСервере();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ДатаКалендаряПриИзменении(Элемент)

	ОбновитьКалендарьНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	Если НЕ ЗначениеЗаполнено(Расшифровка) Тогда
		Возврат;
	КонецЕсли;

	// Расшифровка = "ИндексКомнаты_ИндексСлота" (например "0_3")
	Части = СтрРазделить(Расшифровка, "_");
	Если Части.Количество() < 2 Тогда
		Возврат;
	КонецЕсли;

	ИндексКомнаты = Число(Части[0]);
	ИндексСлота   = Число(Части[1]);

	// Вычисляем время слота: 09:00 + ИндексСлота * 30 мин
	МинутОтНачалаДня = 9 * 60 + ИндексСлота * 30;
	Час = Цел(МинутОтНачалаДня / 60);
	Мин = МинутОтНачалаДня - Час * 60;
	ВремяСлота = Дата(Год(ДатаКалендаря), Месяц(ДатаКалендаря), День(ДатаКалендаря), Час, Мин, 0);

	// Ищем существующую бронь или создаём новую
	Данные = ПолучитьДанныеСлота(ИндексКомнаты, ВремяСлота);

	Если ЗначениеЗаполнено(Данные.Бронь) Тогда
		// Открываем существующую бронь
		ПоказатьЗначение(, Данные.Бронь);
	Иначе
		// Создаём новую бронь
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("Комната", Данные.Комната);
		ЗначенияЗаполнения.Вставить("ДатаНачала", ВремяСлота);
		ЗначенияЗаполнения.Вставить("ДатаОкончания", ВремяСлота + 1800);

		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
		ОткрытьФорму("Документ.БронированиеПереговорной.ФормаДокумента", ПараметрыФормы, ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура КомандаНазад(Команда)

	ДатаКалендаря = ДатаКалендаря - 86400;
	ОбновитьКалендарьНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура КомандаВперед(Команда)

	ДатаКалендаря = ДатаКалендаря + 86400;
	ОбновитьКалендарьНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура КомандаСегодня(Команда)

	ДатаКалендаря = НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса());
	// Если нет БСП, замените строку выше на:
	// ДатаКалендаря = НачалоДня(ПолучитьДатуСеансаНаСервере());
	ОбновитьКалендарьНаСервере();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьКалендарьНаСервере()

	ТабДок.Очистить();

	// --- Получаем список комнат ---
	ЗапросКомнат = Новый Запрос;
	ЗапросКомнат.Текст =
	"ВЫБРАТЬ
	|	Ссылка,
	|	Наименование
	|ИЗ
	|	Справочник.ПереговорныеКомнаты
	|ГДЕ
	|	НЕ ПометкаУдаления
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";

	ТЗКомнаты = ЗапросКомнат.Выполнить().Выгрузить();
	КоличествоКомнат = ТЗКомнаты.Количество();

	Если КоличествоКомнат = 0 Тогда
		Возврат;
	КонецЕсли;

	// --- Получаем брони на выбранный день ---
	ЗапросБроней = Новый Запрос;
	ЗапросБроней.Текст =
	"ВЫБРАТЬ
	|	Ссылка,
	|	Комната,
	|	ДатаНачала,
	|	ДатаОкончания,
	|	Тема,
	|	Организатор
	|ИЗ
	|	Документ.БронированиеПереговорной
	|ГДЕ
	|	НЕ ПометкаУдаления
	|	И Проведен
	|	И ДатаНачала < &КонецДня
	|	И ДатаОкончания > &НачалоДня";

	ЗапросБроней.УстановитьПараметр("НачалоДня", НачалоДня(ДатаКалендаря));
	ЗапросБроней.УстановитьПараметр("КонецДня", КонецДня(ДатаКалендаря));
	ТЗБрони = ЗапросБроней.Выполнить().Выгрузить();

	// --- Цвета ---
	ЦветШапки       = Новый Цвет(70, 130, 180);   // стальной синий
	ЦветШапкиТекст  = Новый Цвет(255, 255, 255);   // белый
	ЦветВремени      = Новый Цвет(240, 240, 245);
	ЦветСвободно     = Новый Цвет(232, 245, 233);   // светло-зеленый
	ЦветЗанято       = Новый Цвет(255, 205, 210);   // светло-красный
	ЦветТекстЗанято  = Новый Цвет(120, 40, 40);
	ЦветТекстСвободно = Новый Цвет(100, 160, 100);
	ЦветСетки        = Новый Цвет(200, 200, 200);

	// --- Заголовок: дата ---
	ТекстДаты = Формат(ДатаКалендаря, "ДФ='dd MMMM yyyy (dddd)'");
	Область = ТабДок.Область(1, 1, 1, КоличествоКомнат + 1);
	Область.Объединить();
	Область.Текст = ТекстДаты;
	Область.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	Область.Шрифт = Новый Шрифт(, 14, Истина);
	Область.ЦветФона = ЦветШапки;
	Область.ЦветТекста = ЦветШапкиТекст;
	Область.ВысотаСтроки = 10;

	// --- Заголовок: колонки ---
	Ячейка = ТабДок.Область(2, 1);
	Ячейка.Текст = "Время";
	Ячейка.ЦветФона = ЦветШапки;
	Ячейка.ЦветТекста = ЦветШапкиТекст;
	Ячейка.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	Ячейка.Шрифт = Новый Шрифт(, 10, Истина);
	Ячейка.ВысотаСтроки = 8;

	Для К = 0 По КоличествоКомнат - 1 Цикл
		Ячейка = ТабДок.Область(2, К + 2);
		Ячейка.Текст = ТЗКомнаты[К].Наименование;
		Ячейка.ЦветФона = ЦветШапки;
		Ячейка.ЦветТекста = ЦветШапкиТекст;
		Ячейка.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		Ячейка.Шрифт = Новый Шрифт(, 10, Истина);
	КонецЦикла;

	// --- Сетка времени: 09:00 - 19:30 (шаг 30 мин) ---
	ЧасНачала = 9;
	ЧасКонца  = 20; // до 19:30 включительно
	НомерСтроки = 3; // строки 1-2 заняты заголовками
	ИндексСлота = 0;

	Для Ч = ЧасНачала По ЧасКонца - 1 Цикл
		Для ПолуЧас = 0 По 1 Цикл

			Минуты = ПолуЧас * 30;
			ВремяСлота = Дата(Год(ДатаКалендаря), Месяц(ДатаКалендаря), День(ДатаКалендаря), Ч, Минуты, 0);
			ТекстВремени = Прав("0" + Формат(Ч, "ЧГ="), 2) + ":" + ?(Минуты = 0, "00", "30");

			// Колонка времени
			Ячейка = ТабДок.Область(НомерСтроки, 1);
			Ячейка.Текст = ТекстВремени;
			Ячейка.ЦветФона = ЦветВремени;
			Ячейка.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			Ячейка.ВысотаСтроки = 6;

			// Колонки комнат
			Для К = 0 По КоличествоКомнат - 1 Цикл

				КомнатаСсылка = ТЗКомнаты[К].Ссылка;
				Ячейка = ТабДок.Область(НомерСтроки, К + 2);

				// Расшифровка для обработки клика
				Ячейка.Расшифровка = Строка(К) + "_" + Строка(ИндексСлота);

				// Ищем бронь на этот слот
				НайденаБронь = Ложь;
				Для Каждого Бронь Из ТЗБрони Цикл
					Если Бронь.Комната = КомнатаСсылка
						И ВремяСлота >= Бронь.ДатаНачала
						И ВремяСлота < Бронь.ДатаОкончания Тогда

						ТекстБрони = СокрЛП(Бронь.Тема);
						Если ПустаяСтрока(ТекстБрони) Тогда
							ТекстБрони = "Забронировано";
						КонецЕсли;
						ТекстБрони = ТекстБрони + " (" + СокрЛП(Бронь.Организатор) + ")";

						Ячейка.Текст = ТекстБрони;
						Ячейка.ЦветФона = ЦветЗанято;
						Ячейка.ЦветТекста = ЦветТекстЗанято;
						НайденаБронь = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;

				Если НЕ НайденаБронь Тогда
					Ячейка.Текст = "свободно";
					Ячейка.ЦветФона = ЦветСвободно;
					Ячейка.ЦветТекста = ЦветТекстСвободно;
				КонецЕсли;

				Ячейка.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;

			КонецЦикла;

			НомерСтроки = НомерСтроки + 1;
			ИндексСлота = ИндексСлота + 1;

		КонецЦикла;
	КонецЦикла;

	// --- Ширина колонок ---
	ЯчейкаШирина = ТабДок.Область(2, 1);
	ЯчейкаШирина.ШиринаКолонки = 10;

	Для К = 2 По КоличествоКомнат + 1 Цикл
		ЯчейкаШирина = ТабДок.Область(2, К);
		ЯчейкаШирина.ШиринаКолонки = 30;
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеСлота(ИндексКомнаты, ВремяСлота)

	Результат = Новый Структура("Комната, Бронь",
		Неопределено, Неопределено);

	// Находим комнату по индексу
	ЗапросКомнат = Новый Запрос;
	ЗапросКомнат.Текст =
	"ВЫБРАТЬ
	|	Ссылка
	|ИЗ
	|	Справочник.ПереговорныеКомнаты
	|ГДЕ
	|	НЕ ПометкаУдаления
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";

	ТЗ = ЗапросКомнат.Выполнить().Выгрузить();

	Если ИндексКомнаты >= ТЗ.Количество() Тогда
		Возврат Результат;
	КонецЕсли;

	Результат.Комната = ТЗ[ИндексКомнаты].Ссылка;

	// Ищем бронь
	ЗапросБрони = Новый Запрос;
	ЗапросБрони.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка
	|ИЗ
	|	Документ.БронированиеПереговорной
	|ГДЕ
	|	Комната = &Комната
	|	И ДатаНачала <= &Время
	|	И ДатаОкончания > &Время
	|	И НЕ ПометкаУдаления
	|	И Проведен";

	ЗапросБрони.УстановитьПараметр("Комната", Результат.Комната);
	ЗапросБрони.УстановитьПараметр("Время", ВремяСлота);

	РезультатЗапроса = ЗапросБрони.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат.Бронь = Выборка.Ссылка;
	КонецЕсли;

	Возврат Результат;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДатуСеансаНаСервере()

	Возврат ТекущаяДата();

КонецФункции

#КонецОбласти
